[{"id":1702172940,"title":"A Note on Library And Framework\r","author":"Varun Kumawat\r","date":"December 10, 2023","time":"07:19","thumbnail":"/images/uploads/instagram-post-24.png\r","content":"**Hi everyone**, I'm Varun and today you're gonna learn about the differences between a *library* and a *framework*!\\\r\nLets get started,\\\r\n\\\r\nDevelopers often use the terms 'framework' and 'library' interchangeably, but there is a huge **difference** between them.\r\n\r\nThis difference is based on a term called 'inversion of control': In the case of a library, let's say React, you call the library when you need it. On the other hand, in the case of a framework, let's say Nextjs, your framework controls/calls your code and you're bonded by the rules and regulations of the framework.","tag":"No tag given"},{"id":1693907280,"title":"NEMU's packing list for NFDA conference\r","author":"Sourav\r","date":"September 05, 2023","time":"15:18","thumbnail":"/images/uploads/blog1.png\r","content":"Team Nemu and I are excited about attending the upcoming NFDA Convention and Expo in Vegas. I am thrilled by the return of in-person events. To help prepare for the conference, we have put together a handy pre-event packing checklist for you:\r\n\r\nPlenty of business cards for networking.\r\n\r\nComfortable shoes, preferably slip-ons, for a lot of walking.\r\n\r\nA reusable water bottle to keep you hydrated.\r\n\r\nTech essentials: chargers, battery packs, etc.\r\n\r\nPersonal care items: hand sanitizer, lip balm, and essential medication\r\n\r\nA portable steamer for any last-minute touch-ups on your attire.\r\n\r\nSpare luggage space for the swag you'll undoubtedly collect.\r\n\r\nAnd don't worry about snacks; join us at the Nemu booth #738 for a snack break.\r\n\r\n\r\n\r\nAs a fellow professional serving families during difficult transitions, I understand the invaluable service you provide. I started Nemu based on my personal journey of helping my own family through the inheritance division after my grandmother's passing. My goal is to make this process smoother and more harmonious for all families.\r\n\r\n\r\n\r\nStop by the Nemu booth #738 to learn how our technology assists families in cataloging, dividing, and managing heirlooms and can expand your business. I'll be there to showcase our platform and discuss collaboration opportunities. If you'd like to chat further, please schedule a time with me!\r\n\r\nAt our booth, you can:\r\n\r\nEnjoy a snack break, courtesy of team Nemu.\r\n\r\nUnderstand how we can augment support for your client families.\r\n\r\nDelve into our affiliate program and its many benefits.\r\n\r\nParticipate in our exclusive NFDA swag giveaways.\r\n\r\nCan't wait to see you at Nemu booth #738 next week, happy travels!","tag":"No tag given"}]